import img1 from '../assets/cards/cart_flash_card.png'
import img2 from '../assets/cards/cart_mug.png'
import img3 from '../assets/cards/cart_pen.png'
import img4 from '../assets/cards/cart_phone_case.png'

export const products = [
    {
        id: 1,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 3155,
        new: true,
        popular: false,
        from: 'от 5₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "147₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "796904557",
    },
    {
        id: 2,
        name: 'Кружка под сублимацию "Стандарт"',
        img: img2,
        availableQuantity: 135,
        new: false,
        popular: false,
        from: 'от 175₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "124₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "metall",
        weight: '214 гр',
        code: "153423558",
    },
    {
        id: 3,
        name: 'Чехол для телефона',
        img: img4,
        availableQuantity: 2,
        new: false,
        popular: false,
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "777₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '124 гр',
        code: "756976462",
    },
    {
        id: 4,
        name: 'Флеш-карта "Элегант"',
        img: img1,
        availableQuantity: 777,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "604₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "710592316",
    },
    {
        id: 5,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 378,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "209₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "241710008",
    },
    {
        id: 6,
        name: 'Кружка под сублимацию "Стандарт"',
        img: img2,
        availableQuantity: 57,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "303₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "708016547",
    },
    {
        id: 7,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 17,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "94₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "882390928",
    },
    {
        id: 8,
        name: 'Флеш-карта "Элегант"',
        img: img1,
        availableQuantity: 100,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "395₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "806118613",
    },
    {
        id: 9,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 41,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "456₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "94032276",
    },
    {
        id: 10,
        name: 'Кружка под сублимацию "Стандарт"',
        img: img2,
        availableQuantity: 96,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "720₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "910182348",
    },
    {
        id: 11,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 30,
        new: false,
        popular: true,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "519₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "288013053",
    },
    {
        id: 12,
        name: 'Флеш-карта "Элегант"',
        img: img1,
        availableQuantity: 88,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "130₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "308770108",
    },
    {
        id: 13,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 61,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "10₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "820206495",
    },
    {
        id: 14,
        name: 'Кружка под сублимацию "Стандарт"',
        img: img2,
        availableQuantity: 86,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "648₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "953060541",
    },
    {
        id: 15,
        name: 'Эко-ручка',
        img: img3,
        availableQuantity: 82,
        new: true,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "465₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "760564319",
    },
    {
        id: 16,
        name: 'Флеш-карта "Элегант"',
        img: img1,
        availableQuantity: 16,
        new: false,
        popular: false,
        from: 'от 75₽',
        color: [
            {
                id: 1,
                name: 'Violet',
                hex: "#a20cf2"
            },
            {
                id: 2,
                name: 'Raspberry',
                hex: "#f20c64"
            },
            {
                id: 3,
                name: 'Blue',
                hex: "#0c70f2"
            },
            {
                id: 4,
                name: 'Spring Bud',
                hex: "#adf20c"
            },
            {
                id: 5,
                name: 'Orange',
                hex: "#f2600c"
            },
        ],
        price: "347₽",
        description: "Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть ассоциативно распределены по отраслям. С другой стороны, дальнейшее развитие различных рассуждений! Модель организационной деятельности однозначно фиксирует необходимость направлений прогрессивного развития.",
        size: '950х81х81 мм',
        material: "plastic",
        weight: '31 гр',
        code: "241932809",
    },
]